export const bodhicittaPrayer = `透过由无上之观世音和一切诸佛菩萨生起之究竟证悟心之真谛，
愿无上菩提心诞生在虚空下的我及一切众生的心中。

愿痛苦之因——一切众生之嗔恨，以及嗔恨之果——地狱道之炎热与酷寒，都降临于我！融摄于我！
我把我慈爱的一切功德，以及离于嗔恨的闲暇，都布施给虚空下的一切众生。
因此，愿嗔恨之界——地狱道都被净空。
愿地狱道的一切众生，都成为金刚部的观世音，了悟无上之大圆镜智。

愿痛苦之因——一切众生之贪执，以及贪执之果——饿鬼道之饥渴，都降临于我！融摄于我！
我把我慷慨布施的一切功德，以及离于执着的闲暇，都布施给虚空下的一切众生。
因此，愿饿鬼道都被净空。
愿饿鬼道的一切众生，都成为莲花部的观世音，了悟无上之妙观察智。

愿痛苦之因——一切众生之愚痴，以及愚痴之果——野兽之呆笨迟钝，都降临于我！融摄于我！
我把我生起内观的一切功德，以及离于无明的闲暇，都布施给虚空下的一切众生。
因此，愿畜生道都被净空。
愿所有畜生，都成为佛部的观世音，了悟无上之法界体性智。

愿痛苦之因——侵蚀一切众生之心的妒忌，以及忌妒之果——阿修罗的交战，都降临于我！融摄于我！
我把我展现于身、语、意之忍辱的一切功德，以及离于忌妒的闲暇，都布施给虚空下的一切众生。
因此，愿阿修罗道都被净空。
愿阿修罗道的一切众生，都成为事业部的观世音，了悟无上之成所作智。

愿痛苦之因——众生之骄慢，以及骄慢之果——天道众生最后堕入恶趣，都降临于我！融摄于我！
我把我精进的一切功德，以及离于骄慢的闲暇，都布施给虚空下的一切众生。
因此，愿天道都被净空。
愿天道的一切众生，都成为宝部的观世音，了悟无上之平等智慧。

愿众生的痛苦之因——自无始以来的恶业与障蔽，以及恶业与障蔽之果——生、老、病、死之痛苦，都降临于我！融摄于我！
我把我自无始以来，用身、语、意积聚的一切功德，都布施给虚空下的一切众生。
因此，愿人道都被净空。
愿一切众生都成为无染法身之观世音，了悟无上之自生智慧。

愿一切众生所犯下违逆别解脱戒、菩萨戒和秘密密咒乘之誓戒的过失，都降临于我！融摄于我！
我把我持守三种誓戒的功德布施给虚空下的一切众生。
愿众生的誓戒变得全然清净，不受到丝毫堕落的染污。
愿一切众生都证得金刚萨埵——所有佛部之化现——的果位。

愿恶业、障蔽，以及杀生、毁坏法器等行为所造成的短命，都降临于我！融摄于我！
我把我护生和制作法器的功德布施给虚空下的一切众生。
愿早逝成为一个从未听闻的辞汇，
愿一切众生达成金刚长寿佛的果位。

愿一切众生因为风息、胆汁、黏液及其他元素失衡所引起的疾病，都降临于我！融摄于我！
我把我弃绝任何一种暴力、提供医药及其他有益事物的功德布施给虚空下的一切众生。
我把我自己的健康安泰布施给一切众生。
愿一切众生达到药师佛的果位，其琉璃光身驱除三毒之苦恼祸害。

愿偷盗、用武力夺取他人之物所引起的饥渴贫困，都降临于我！融摄于我！
我把佛法、财富和布施之果布施给虚空下的一切众生。
愿一切众生享用这天藏：毫不费力、自然而然地实现一切需求。

愿由于不断从事有害的行为而投生不净地域的恶业和障蔽，都降临于我！融摄于我！
我把我生起之菩提心和十种转化，回向给虚空下的一切众生。
愿他们投生净喜、极乐等清净佛土。

愿由于不断怀有触怒三宝之邪见所引起之恶业与障蔽，都降临于我！融摄于我！
我把生起三种信心之功德，布施给虚空下的一切众生。
愿他们对因果业报之无谬法则生起全然的信心，用善行来取代恶行。

愿不断专注于自我所生起的执着嗔恨——这种执着嗔恨把每一件事物视为威胁，都降临于我！融摄于我！
我把怀有四无量之念的所有功德，布施给虚空下的一切众生。
愿他们的心充满慈、悲、喜、舍。

愿所有痛苦之根源——把虚幻视为真实的迷妄心，都降临于我！融摄于我！
我把对无我空性的了悟，布施给虚空下的一切众生。
愿甚深之空性在他们心中生起，愿他们圆满成佛。

简而言之，我承担所有变动无常所带来的痛苦；
事与愿违所带来的痛苦——恐惧的十六种来源等等；
与所爱之人、事、物分别所带来的痛苦——与亲人、朋友、处所、食物和财富分别；
无法保有所拥有之事物所带来的痛苦——如保护亲属、击败对手、辛勤从事农务和贸易所得到的事物；
无法得到所希冀的事物所带来的痛苦——关于权势、财产和名声；
受到突如其来的灾祸和邪恶势力的打击所带来的痛苦。

我承担我自己的我执和所有这些痛苦，
同时，我毫不保留地把过去、现在、未来三世的所有功德布施给一切众生；
我把我的影响力、权势、我的身体、我的生命，布施给一切众生。
愿一切众生享受安乐，从事菩萨的行为。

愿与我结下善缘或恶缘的一切众生——
透过我教导他们佛法，鼓励他们行善所结下之缘；
或透过我吃他们的肉、饮他们的乳汁、或骑乘在他们身上所结下之缘；
或透过信赖、敬重我，供养我食物和财富所结下之缘；
或透过批评我、怀疑我、厌恶我、劫掠我、殴打我、伤害我所结下之缘。

简而言之，任何曾经见过我、听过我的名号、想到我善或不善的品质，
甚或曾经被从我这个方向吹过的风碰触到的一切众生，
愿他们自无始以来所累积的恶业和障蔽有所终止。
愿他们前往大慈大悲无上千手观音的极乐净土。

愿我能够透过身、语、意来利益众生，甚至能够透过我的影子来利益众生。
愿所有心怀恶意、想要伤害我的身体和我的生命的一切众生——包括人和非人的一切众生，
成为首批获致证悟的众生。
愿即使是最微小的伤害，也不要因为我的缘故而降临。

当我们检视现象，我们发现没有什么现象具有任何真实的存在。
一切事物如梦，如海市蜃楼，如倒影，如水中之月。
然而，每个人却愚蠢地把事物视为真实。

在胜义谛之中，我和所有其他在虚空底下的众生，
即使是非人、邪灵和障碍制造者，在空性的领域中，都是平等的。
然而，把空虚视为真实，我们全都陷入迷妄。

在世俗谛之中，没有一个众生不曾是每一个其他众生的父母。
在整个世界之中，有谁比一个父亲或一个母亲更加慈爱？
一个母亲希望去伤害自己的孩子，这是什么样的迷妄！
这是为什么，我们要没有偏袒地忆念所有这些母众的仁慈，
我应该把得与利献给他们，把失与衰由自己承担。

透过我清净发心的力量，
愿一切众生清净他们的恶业，
圆满地积聚资粮，
毫不造作地生起无上菩提心，
此乃充满慈悲之空性，胜者之无谬道路，
并且迅速证得遍知成佛。

为了生起修心之愿，蒋贡康楚罗卓泰耶在僻静山间的隐居所，造了此一真诚的祈愿文。愿它充满利益，愿一切吉祥。`;

export const guruPrayer = `上师鉴知我，具恩根本上师鉴知我！

三世诸佛之自性　教证正法之根源
圣众僧伽之主体　根本上师鉴知我

慈悲加持之巨藏　二种成就之生处
事业所愿悉赐予　根本上师鉴知我

上师无量光佛鉴知我　祈自离戏法身界垂顾
我等流转轮回恶业众　得接引至大乐清净土

上师观音菩萨鉴知我　祈自净光报身界垂顾
彻底平息六道之痛苦　拔济三界轮回出樊笼

上师莲花生处鉴知我　祈自北瞻莲光境垂顾
浊世失怙弱小之众生　愿以悲心迅亟为怙佑

上师智慧胜海鉴知我　祈自大乐空行域垂顾
我等恶业众出三有海　度脱至大解脱之境域

教藏传承祖师鉴知我　祈自双运智慧界垂顾
穿越自心迷妄之暗室　愿令生起证悟之慧日

遍智无垢光尊鉴知我　祈从任运五光境垂顾
圆满本净密意之大力　愿令达到四相之究竟

无等至尊父子鉴知我　祈自兜率天众中垂顾
具足空性慈悲之体性　愿令自心生起菩提心

胜成就三祖师鉴知我　祈自大乐金刚界垂顾
成就殊胜空乐大手印　愿令觉悟心中妙法身

世自在噶玛巴鉴知我　祈自调御众生界垂顾
了知一切法非真如幻　愿令外境心识显三身

噶举四大八小鉴知我　祈从圣观清净土垂顾
净除四位之迷妄幻惑　愿令达到证悟之彼岸

尊者萨迦五祖鉴知我　祈自轮涅无别界垂顾
圆融清净见修行三者　愿令步上殊胜秘密道

无等香巴噶举鉴知我　祈自清净之佛土垂顾
如理修习方便解脱法　愿令获致无学之双运

大成就者胜原鉴知我　祈自无为大悲界垂顾
成就证悟虚幻之禁行　愿令和合心气得自在

唯一胜妙佛父鉴知我　祈自成胜事业界垂顾
传承加持得入于心中　愿令生起无方之缘起

唯一语灯佛母鉴知我　祈自智慧彼岸界垂顾
彻底断除我执之骄魔　愿令亲见无我离戏谛

遍智多波桑杰鉴知我　祈自完全净妙界垂顾
得引一切气止习中脉　愿令证得无死金刚身

尊者救度怙主鉴知我　祈自三种使者界垂顾
无碍步上金刚秘密道　愿令成就空行之虹身

妙音悲智大力鉴知我　祈自二智智慧境垂顾
觉醒无知心识之暗钝　愿令开展无上智慧相

净光化身金刚鉴知我　祈自五色虹光界垂顾
净除心气明点之障垢　愿令圆满童子宝瓶身

莲华经密续洲鉴知我　祈自乐空不动境垂顾
佛与佛子之一切密意　愿令弟子堪能悉领受

语自在功德海鉴知我　祈自空智双运界垂顾
摧破一切法相之执实　愿令显境皆堪能入道

佛子无边智慧鉴知我　祈自慈悲之自性垂顾
了知众生皆具恩父母　愿令堪能发心修利他

莲华游戏自在鉴知我　祈自大乐净光界垂顾
度脱五毒转化为五智　愿令摧毁取舍二执着

二教永固卍洲鉴知我　祈自轮涅平等界垂顾
心续生起真实之虔敬　愿令证悟解脱俱时增

具恩根本上师鉴知我　祈自头顶大乐轮垂顾
亲晤自明法身真面目　愿令一生即能圆成佛

嗟呼！

同我一般恶业有情众　无始以来长转轮回中
尚需历尽无边之痛苦　刹那厌离亦未曾生起
上师鉴知我！祈以慈悲亟垂顾！
加持生起甚深之出离

已得暇满人生竟虚度　此生无义所作常散逸
懒于承担大利解脱行　无异从财宝洲空手回
上师鉴知我！祈以慈悲亟垂顾！
加持成就具义之人生

人生在世无人能不死　如今一一陆续赴黄泉
我亦不免迅速将逝去　腐心却做长久住世计
上师鉴知我！祈以慈悲亟垂顾！
加持无暇故而减营计

心所爱悦亲友纷离去　悭吝所集财物任人享
珍爱之身随后亦舍弃　中阴神识无知转轮回
上师鉴知我！祈以慈悲亟垂顾！
加持了悟一切皆枉然

可怖无明暗钝迎于前　炽盛凶猛业风逐于后
可憎阎罗使者扑又挞　难忍恶道之苦需历尝
上师鉴知我！祈以慈悲亟垂顾！
加持度脱恶趣之深渊

己恶如山但于心中藏　他恶如芥竟毁谤宣传
无啥功德却自骄贤善　假行者名而只行非法
上师鉴知我！祈以慈悲亟垂顾！
加持平息私心与骄慢

固有祸根我执魔住心　一切心念烦恼增长因
一切行为皆具不善果　于解脱道丝毫不趋进
上师鉴知我！祈以慈悲亟垂顾！
加持断除我执之根柢

些许毁誉即生忧喜心　些许恶言即失忍辱甲
见无助者不生慈悲心　临布施境却为悭吝缚
上师鉴知我！祈以慈悲亟垂顾！
加持心续得与法合一

无实轮回却执为有实　为衣食故舍究竟意乐
生活资具贪得而无厌　非真如幻之法欺自心
上师鉴知我！祈以慈悲亟垂顾！
加持舍弃贪着此世心

微细身心苦恼亦不忍　趋于恶趣仍顽强无惧
因果不爽历历而现前　不修善业徒增罪恶状
上师鉴知我！祈以慈悲亟垂顾！
加持生起信仰业力心

嗔敌爱亲之心常生起　于取舍境迷惑似愚痴
如法行时昏沉而无力　非法行时聪明而机敏
上师鉴知我！祈以慈悲亟垂顾！
加持摧伏烦恼与怨敌

外表俨然清净行者相　于自内心却与法相违
如毒蛇般烦恼藏于心　遇缘即露行者之罪迹
上师鉴知我！祈以慈悲亟垂顾！
加持自心能调伏自心

自身过恶自己不察知　持行者相行种种非法
烦恼不善之业常熏习　善心一再滋生一再斫
上师鉴知我！祈以慈悲亟垂顾！
加持自己照见己过失

逝者如斯死亡日益近　日复一日自心益顽强
依止上师虔诚次第减　兄弟仁爱悲悯逐渐薄
上师鉴知我！祈以慈悲亟垂顾！
加持调伏自心之难驯

虽已皈依发心与祈请　虔敬慈悲未自心底生
只依文字修法与行善　行持僵化无法深心信
上师鉴知我！祈以慈悲亟垂顾！
加持所作皆趋入佛法

一切痛苦源于求己乐　经云以利他心而成佛
发殊胜心却深藏私欲　利他附带成就害他行
上师鉴知我！祈以慈悲亟垂顾！
加持堪能自他相换行

上师即佛却执为凡夫　开示深教恩德旋遗忘
若己所愿不遂即退心　怀疑师行而为邪见蔽
上师鉴知我！祈以慈悲亟垂顾！
加持增加虔敬勿退失

自心即佛但不识本性　妄念即法身竟不了悟
任运即真性而难保任　自然即本性却不相信
上师鉴知我！祈以慈悲亟垂顾！
加持解脱自明自性地

身亡必来不堪心忆持　正法实益不堪如理修
业果真谛不如理取舍　念知必要不依而散逸
上师鉴知我！祈以慈悲亟垂顾！
加持记取无散之正念

前世恶业故生此浊世　往昔所作一切皆苦因
恶友皆为罪恶之覆影　信乐无义之言疏善行
上师鉴知我！祈以慈悲亟垂顾！
加持堪能精进于佛法

起初发心佛法别无他　末了果报轮回恶道因
解脱果为不善霜所摧　我等过恶难驯毁终的
上师鉴知我！祈以慈悲亟垂顾！
加持度至正法之彼岸

生起甚深出离祈加持　无暇故减营谋祈加持
内心忆念死亡祈加持　生起业之信仰祈加持
修行道上无碍祈加持　修行堪能精进祈加持
恶缘取之入道祈加持　堪能对治自心祈加持
生起真实虔诚祈加持　亲晤真理自性祈加持
觉醒心中自明祈加持　彻底断除妄境祈加持
一生即能成佛祈加持

至诚祈请尊贵上师宝　悲切呼求具恩之法王
自身不堪非尊无所依　师心我心合一无别祈加持`;

export const paragraphs = (text: string) => text.split(/\n\n+/);
